## Concat DataFrames

In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({'city': ['mumbai','delhi','banglore'],
                               'temperatur':[32,45,30],
                                'humidity':[80,60,78]})

In [3]:
india_weather

       city  temperatur  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78

In [4]:
us_weather = pd.DataFrame({'city': ['newyork','chicago','orlando'],
                               'temperatur':[21,14,35],
                                'humidity':[68,65,75]})

In [6]:
us_weather

      city  temperatur  humidity
0  newyork          21        68
1  chicago          14        65
2  orlando          35        75

In [7]:
df = pd.concat([india_weather, us_weather])

In [8]:
df

       city  temperatur  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78
0   newyork          21        68
1   chicago          14        65
2   orlando          35        75

### here we can see that index in not in order hence we can ifnore the index

In [9]:
df = pd.concat([india_weather, us_weather], ignore_index = True)

In [10]:
df

       city  temperatur  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78
3   newyork          21        68
4   chicago          14        65
5   orlando          35        75

### Let say we have to print only one country weather we can do this by providing key
### we associate every data with key

In [11]:
df = pd.concat([india_weather, us_weather], ignore_index = True, keys=['india','us'])

In [12]:
df

       city  temperatur  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78
3   newyork          21        68
4   chicago          14        65
5   orlando          35        75

In [13]:
df = pd.concat([india_weather, us_weather], keys=['india','us'])

In [14]:
df

             city  temperatur  humidity
india 0    mumbai          32        80
      1     delhi          45        60
      2  banglore          30        78
us    0   newyork          21        68
      1   chicago          14        65
      2   orlando          35        75

In [15]:
df.loc['india']

       city  temperatur  humidity
0    mumbai          32        80
1     delhi          45        60
2  banglore          30        78

In [16]:
df.loc['us']

      city  temperatur  humidity
0  newyork          21        68
1  chicago          14        65
2  orlando          35        75

In [19]:
temp_df = pd.DataFrame({'city':['mumbai', 'delhi', 'banglore'],
                         'temperature':[35,42,24]})

In [20]:
temp_df

       city  temperature
0    mumbai           35
1     delhi           42
2  banglore           24

In [21]:
windspeed_df = pd.DataFrame({'city':['mumbai', 'delhi', 'banglore'],
                         'windspeed':[7,20,35]})

In [22]:
windspeed_df

       city  windspeed
0    mumbai          7
1     delhi         20
2  banglore         35

In [24]:
df  = pd.concat([temp_df, windspeed_df], sort=True)

In [25]:
df

       city  temperature  windspeed
0    mumbai         35.0        NaN
1     delhi         42.0        NaN
2  banglore         24.0        NaN
0    mumbai          NaN        7.0
1     delhi          NaN       20.0
2  banglore          NaN       35.0

In [26]:
df  = pd.concat([temp_df, windspeed_df], axis=1)

In [27]:
df

       city  temperature      city  windspeed
0    mumbai           35    mumbai          7
1     delhi           42     delhi         20
2  banglore           24  banglore         35

In [30]:
temp_df = pd.DataFrame({'city':['mumbai', 'delhi', 'banglore'],
                         'temperature':[35,42,24]}, index=[0,1,2])

In [31]:
temp_df

       city  temperature
0    mumbai           35
1     delhi           42
2  banglore           24

In [32]:
windspeed_df = pd.DataFrame({'city':['delhi', 'banglore', 'mumbai'],
                         'windspeed':[7,20,35]}, index=[1,2,0])

In [36]:
df = pd.concat([temp_df, windspeed_df], axis=1)

In [37]:
df

       city  temperature      city  windspeed
0    mumbai           35    mumbai         35
1     delhi           42     delhi          7
2  banglore           24  banglore         20

### we can join series with dataframe also

In [39]:
s = pd.Series(['humid', 'dry', 'rain'], name='event')

In [40]:
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [41]:
df = pd.concat([temp_df, s], axis=1)

In [42]:
df

       city  temperature  event
0    mumbai           35  humid
1     delhi           42    dry
2  banglore           24   rain